{
    "_name_or_path": "./",
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "add_bias_logits": false,
    "add_final_layer_norm": true,
    "architectures": [
        "BlenderbotForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "classif_dropout": 0.0,
    "classifier_dropout": 0.0,
    "d_model": 1280,
    "decoder_attention_heads": 32,
    "decoder_ffn_dim": 5120,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 12,
    "decoder_start_token_id": 1,
    "do_blenderbot_90_layernorm": true,
    "dropout": 0.1,
    "encoder_attention_heads": 32,
    "encoder_ffn_dim": 5120,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 2,
    "eos_token_id": 2,
    "extra_layer_norm": false,
    "extra_pos_embeddings": 0,
    "force_bos_token_to_be_generated": false,
    "gradient_checkpointing": false,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1",
        "2": "LABEL_2"
    },
    "init_std": 0.02,
    "is_encoder_decoder": true,
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1,
        "LABEL_2": 2
    },
    "layernorm_variant": "prelayernorm",
    "length_penalty": 0.65,
    "max_length": 60,
    "max_position_embeddings": 128,
    "min_length": 20,
    "model_type": "blenderbot",
    "no_repeat_ngram_size": 3,
    "normalize_before": true,
    "normalize_embedding": false,
    "num_beams": 10,
    "num_hidden_layers": 2,
    "pad_token_id": 0,
    "scale_embedding": true,
    "static_position_embeddings": false,
    "transformers_version": "4.2.0dev0",
    "unk_token_id": 3,
    "use_cache": false,
    "vocab_size": 3511,
    "initializer_range": 0.02
}